<?php
/**
*
* @молоток для запрета пакетов
* @ *@авторское право (c) 2015 phpBBМоддеры<https://phpbbmodders.net />
* @автор Яри Канерва
* @лицензия http://opensource.org/licenses/gpl-2.0.php Общая общественная лицензия GNU v2
*
*/

/**
* @игнорировать
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

/**
* НЕ МЕНЯЙТЕ
*/
if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

//РАЗРАБОТЧИКИ, ПОЖАЛУЙСТА, ОБРАТИТЕ ВНИМАНИЕ
//
//// Все языковые файлы должны использовать UTF-8 в качестве кодировки, и файлы не должны содержать бомбу.
//
//Заполнители теперь могут содержать информацию о заказе, например, вместо
// "Страница %s%s" вы можете (и должны) написать "Страница %1$s %2$s", это позволяет
//переводчики для изменения порядка вывода данных, обеспечивая при этом их правильность
//
//Вам это не нужно, если используются одиночные заполнители, например, "Сообщение %d" подходит
//одинаково, если строка содержит только два заполнителя, которые используются для переноса текста
////в URL-адресе вам снова не нужно указывать порядок, например, "нажмите %shere%s" - это нормально
$lang = array_merge($lang, array(
	'ACP_BAN_EMAIL'		=> 'Блокування користувачів по базі e-mail адреси',
	'ACP_BAN_IP'		=> 'Блокування користувачів по базі IP-адреси',
	'ACP_BAN_IP_EXPLAIN'	=> '<strong>Будьте обережні з цим.</strong> Більшість домашніх користувачів мають динамічні IP-адреси, і їм потрібно лише перезавантажити свій маршрутизатор/модем, щоб отримати нову IP-адресу. Наступного дня ця IP-адреса може бути призначена користувачеві, якого ви хочете бачити на своєму сайті. Спамери також використовують анонімні проксі-сервери в Інтернеті або мережу Tor, що робить безглуздим заборону IP-адрес.',

	'ACP_DEL_AVATAR'	=> 'Видалити аватар користувача',
	'ACP_DEL_PRIVMSGS'	=> 'Видалення особистих повідомлень користувача',
	'ACP_DEL_POSTS'		=> 'Видаляти повідомлення користувача',
	'ACP_DEL_PROFILE'	=> 'Видаляти поля профілю користувача',
	'ACP_DEL_SIGNATURE'	=> 'Видалити підпис користувача',

	'ACP_GROUP_MISSING'	=> 'Групи &quot;%s&quot; не існує.', // %s является ли название группы.

	'ACP_MOVE_GROUP'			=> 'Перейти до групи',
	'ACP_MOVE_GROUP_EXPLAIN'	=> 'Назва групи, до якої слід перемістити заблокованих користувачів. Це також буде їхня група за замовчуванням.<br /><strong>Якщо нічого, крім <em>“Група не вказана”</em> перебуває в списку, отже, ви не створили жодних груп.</strong>',
	'BAN_LENGTH_EXPLAIN'	=> 'Якщо встановлено будь-який з банківських параметрів, користувач буде заблокований на час, вказаний тут. Це також може бути встановлене при забороні по базі Ban Hammer.',
	'SETTINGS_ERROR'		=> 'Помилка при збереженні ваших налаштувань. Будь ласка, надішліть зворотне трасування разом із вашим звітом про помилку.',
	'SFS_API_KEY'			=> 'SFS API Ключ',
	'SFS_API_KEY_EXPLAIN'	=> 'Якщо ви хочете автоматично повідомляти про спамери в StopForumSpam, вам знадобиться ключ API, <a href="http://www.stopforumspam.com/signup">http://www.stopforumspam.com/signup</a>.',
	'SFS_NEEDS_CURL'		=> '<span style="color:red;">На вашому сервері має бути встановлений cURL, щоб використовувати службу зупинки спаму на форумі.</span>',
));
