<?php
/**
*
* @молоток для запрета пакетов
* @ *@авторское право (c) 2015 phpBBМоддеры<https://phpbbmodders.net />
* @автор Рич Макгирр (rmcgirr83)
* @автор Яри Канерва
* @лицензия http://opensource.org/licenses/gpl-2.0.php Общая общественная лицензия GNU v2
*
*/

/**
* НЕ МЕНЯЙТЕ
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'BANNED_ERROR'		=> 'Виникла помилка!',
	'BANNED_SUCCESS'	=> 'Усі дії були виконані правильно.',

	'ERROR_BAN_EMAIL'	=> 'Не вдалося заблокувати користувачів по базі e-mail адреси',
	'ERROR_BAN_IP'		=> 'Не вдалося заблокувати користувачів по базі IP-адреси',
	'ERROR_BAN_USER'	=> 'Не вдалося заблокувати користувачів по базі імені користувача',
	'ERROR_DEL_POSTS'	=> 'Не вдалося видалити повідомлення користувачів',
	'ERROR_MOVE_GROUP'	=> 'Не вдалося перемістити користувача до обраної групи',
	'ERROR_SFS'			=> 'Помилка з повідомленням до бази даних спаму Ban Hammer',

	'BH_BAN_EMAIL'			=> 'Заборонити цю адресу електронної пошти користувача',
	'BH_BAN_GIVE_REASON'	=> 'Причину цієї заборони показано користувачеві',
	'BH_BAN_IP'				=> 'Заборонити IP-адресу цього користувача',
	'BH_BAN_IP_EXPLAIN'		=> '<strong>Будьте обережні з цим.</strong> Більшість домашніх користувачів мають динамічні IP-адреси, і їм потрібно лише перезавантажити свій маршрутизатор/модем, щоб отримати нову IP-адресу. Наступного дня ця IP-адреса може бути призначена користувачеві, якого ви хочете бачити на своєму сайті. Спамери також використовують анонімні проксі-сервери в Інтернеті або мережу Tor, що робить безглуздим заборону IP-адрес.',
	'BH_BAN_LENGTH'			=> 'Забанити цього користувача за %s',
	'BH_BAN_REASON'			=> 'Внутрішня причина цієї заборони',
	'BH_BAN_USER'			=> 'Забанити цього користувача за %s',
	'BH_BAN_USER_PERM'		=> 'Назавжди заборонити це ім\'я користувача',
	'BH_BAN_EMAIL_PERM'		=> 'Назавжди заборонити цю адресу електронної пошти користувача',
	'BH_BAN_EMAIL_FOR'		=> 'Заборонити цю адресу електронної пошти користувача для %s',
	'BH_BAN_IP_PERM'		=> 'Назавжди заборонити цю IP-адресу користувача',
	'BH_BAN_IP_FOR'			=> 'Заборонити цю IP-адресу користувача для %s',
	'BH_BANNED'				=> 'Цей користувач забанен',

	'BH_DEL_AVATAR'		=> 'Видалити аватар цього користувача',
	'BH_DEL_PRIVMSGS'	=> 'Видалити особисті повідомлення цього користувача',
	'BH_DEL_POSTS'		=> 'Видалити повідомлення цих користувачів',
	'BH_DEL_PROFILE'	=> 'Видалити поля профілю цього користувача',
	'BH_DEL_SIGNATURE'	=> 'Видалити підпис цього користувача',

	'BH_MOVE_GROUP'	=> 'Перемістити цього користувача до групи &quot;%s&quot;', // %s будет именем группы

	'BH_REASON'		=> 'Внутрішня причина &quot;%s&quot;', // %s будет причиной
	'BH_REASON_USER'	=> 'Причина для користувача &quot;%s&quot;', // %s будет причиной

	'BH_SUBMIT_SFS'	=> 'Надіслати, щоб зупинити спам на форумі',

	'BH_THIS_USER'	=> 'Забанити цього користувача',

	'SFS_REPORT'	=> 'Повідомте про цього користувача у систему Ban Hammer, щоб зупинити спам на форумі',
	'SURE_BAN'		=> 'Ви впевнені, що хочете заборонити <strong>%s</strong>?', // %s будет имя пользователя.

	'THIS_WILL'	=> 'Це буде',
));
