<?php
/**
 *
 * Advertisement management. An extension for the phpBB Forum Software package (russian).
 *
 * @copyright (c) 2017 phpBB Limited <https://www.phpbb.com>
 * @license GNU General Public License, version 2 (GPL-2.0)
 *
 */

if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	// Manage ads
	'AD_SETTINGS'				=> 'Налаштування',
	'ACTIVE_ADS'				=> 'Активовані блоки',
	'EXPIRED_ADS'				=> 'Деактивовані блоки',
	'STATUS'					=> 'Статус',
	'AD_NAME'					=> 'Назва',
	'AD_NAME_EXPLAIN'			=> 'Назва потрібна тільки для полегшення ідентифікації цього рекламного блоку.',
	'AD_ENABLED'				=> 'Увімкнено',
	'AD_ENABLED_EXPLAIN'		=> 'Якщо вимкнено, цей блок не буде показаний.',
	'AD_NOTE'					=> 'Зауваження',
	'AD_NOTE_EXPLAIN'			=> 'Введіть будь-який текст. Цей текст не буде показаний ніде, крім ACP і є необов\'язковим параметром.',
	'AD_CODE'					=> 'Код',
	'AD_CODE_EXPLAIN'			=> 'Введіть тут код реклами. Весь код має використовувати HTML-розмітку, BBCodes не підтримуються.<br><br>Примітка: Якщо ця реклама розміщує файли cookie, збирає дані користувачів або відстежує їхню поведінку, увімкніть <strong>Розкриття інформації про рекламу</strong> на панелі <samp class="error">Керування рекламою » Налаштування</samp>. Якщо ви не впевнені, увімкніть його.',
	'AD_CODE_CONSENT_EXPLAIN'	=> 'Також увімкніть опцію <strong>Вимагати згоди на маркетинг</strong> нижче, щоб сценарії цієї реклами відкладалися, доки відвідувач не дозволить маркетинг у своїх налаштуваннях конфіденційності.',
	'ANALYSE_AD_CODE'			=> 'Аналізувати код',
	'EVERYTHING_OK'				=> 'Код відповідає вимогам.',
	'AD_BANNER'					=> 'Банер',
	'BANNER'					=> 'Завантажити банер',
	'BANNER_EXPLAIN'			=> 'Ви можете завантажити зображення у форматі JPG, GIF або PNG. Зображення буде збережено в каталозі <samp>images</samp> phpBB, а тег HTML IMG для зображення буде автоматично вставлено в поле рекламного коду.',
	'BANNER_UPLOAD'				=> 'Завантажити баннер',
	'AD_PLACEMENT'				=> 'Розташування',
	'AD_LOCATIONS'				=> 'Месце розташування блоку',
	'AD_LOCATIONS_EXPLAIN'		=> 'Виберіть місця, де ви хочете відображати цю рекламу. Наведіть курсор миші на місце, щоб переглянути його короткий опис. Якщо кілька оголошень використовують одне й те саме місце, щоразу для відображення в цьому місці буде випадковим чином вибрано одне оголошення. Використовуйте CTRL+CLICK (або CMD+CLICK на Mac), щоб вибрати/скасувати вибір кількох місць.',
	'AD_LOCATIONS_VISUAL_DEMO'	=> 'Показати візуально місця блоків',
	'AD_PRIORITY'				=> 'Пріоритет',
	'AD_PRIORITY_EXPLAIN'		=> 'Встановіть значення від 1 до 10. Блок з вищим пріоритетом буде показуватися частіше ніж другий, якщо для них призначено те саме місце показу, що і для цього блоку.',
	'AD_CONTENT_ONLY'			=> 'Показати тільки на сторінках контенту',
	'AD_CONTENT_ONLY_EXPLAIN'	=> 'Ця реклама відображатиметься лише на сторінках, що містять контент. Вона не відображатиметься на таких сторінках, як UCP, вхід, реєстрація, публікація, відповідь тощо. Деякі рекламні платформи (наприклад, Google AdSense) цього вимагають.',
	'AD_OPTIONS'				=> 'додаткові налаштування',
	'AD_OWNER'					=> 'Власник',
	'AD_OWNER_EXPLAIN'			=> 'Призначення власника реклами надасть одному з членів вашої ради дозвіл переглядати статистику переглядів та кліків цієї реклами на своїй панелі керування. Залиште це поле порожнім, щоб не призначати власника реклами.',
	'AD_VIEWS'					=> 'Перегляди',
	'AD_VIEWS_LIMIT'			=> 'Ліміт показів',
	'AD_VIEWS_LIMIT_EXPLAIN'	=> 'Встановіть максимальну кількість показів реклами, після якої вона більше не відображатиметься. Встановіть 0 для необмеженої кількості переглядів.',
	'AD_CLICKS'					=> 'Кліки',
	'AD_CLICKS_LIMIT'			=> 'Ліміт кліків',
	'AD_CLICKS_LIMIT_EXPLAIN'	=> 'Встановіть максимальну кількість кліків на рекламу, після якої вона більше не відображатиметься. Встановіть 0 для необмеженої кількості кліків.',
	'AD_CONSENT'				=> 'Вимагати згоди на маркетингові кампанії',
	'AD_CONSENT_EXPLAIN'		=> 'Установіть значення «Так», щоб відкласти теги скриптів у цій рекламі, доки відвідувач не надасть маркетингову згоду в налаштуваннях конфіденційності. Установіть значення «Ні» лише для рекламного коду, який не завантажує маркетингові ресурси, ресурси відстеження, файли cookie, профілювання чи інші ресурси, що контролюються згодою.<br><br>Примітка. Цей параметр не впливає на підтримуваний код Google AdSense або код тегу видавця Google (GPT). Менеджер згоди автоматично керує згодою на рекламу Google через режим згоди Google.',
	'AD_START_DATE'				=> 'Початок показів',
	'AD_START_DATE_EXPLAIN'		=> 'Встановіть дату, коли може початися показ реклами (починаючи з 00:00). Для показу реклами все одно потрібно вручну ввімкнути її. Якщо дату не встановлено, реклама зможе відображатися одразу після ввімкнення.',
	'AD_END_DATE'				=> 'Закінчення показів',
	'AD_END_DATE_EXPLAIN'		=> 'Встановіть дату, коли реклама автоматично припинить показ (о 00:00). Якщо дату не встановлено, реклама залишатиметься активною, доки її не буде вимкнено вручну.',
	'AD_CENTERING'				=> 'Автоматично центрувати це оголошення',
	'AD_CENTERING_EXPLAIN'		=> 'Встановіть значення «Так», щоб це розширення автоматично центрувало ваше оголошення. Якщо це призводить до небажаних результатів, використовуйте CSS безпосередньо в коді, щоб відповідно центрувати ваше оголошення.',

	'AD_ENABLE_TITLE'			=> array( // Plural rule doesn't apply here! Just translate the values.
		0 => 'Клікніть для увімкнення',
		1 => 'Клікніть для вимкнення',
	),
	'AD_EXPIRED_EXPLAIN'		=> 'Час показу цієї реклами минув, і вона була відключена.',
	'ACP_ADS_EMPTY'				=> 'Нема реклами для показу. Додайте рекламний блок за допомогою кнопки нижче.',
	'ACP_ADS_ADD'				=> 'Додати новий блок',
	'ACP_ADS_EDIT'				=> 'Редагувати рекламний блок',

	'AD_NAME_REQUIRED'			=> 'Назва обов\'язкова.',
	'AD_NAME_TOO_LONG'			=> 'Перевищено обмеження %d символів довжини назви блоку.',
	'AD_CODE_ILLEGAL_CHARS'		=> 'Код реклами містить такі непідтримувані символи: %s',
	'AD_START_DATE_INVALID'		=> 'Дата початку недійсна або передує сьогоднішній.',
	'AD_END_DATE_INVALID'		=> 'Дата завершення недійсна або передує сьогоднішній.',
	'AD_PRIORITY_INVALID'		=> 'Недопустиме значення. Введіть число в діапазоні від 1 до 10.',
	'AD_VIEWS_LIMIT_INVALID'	=> 'Недопустиме значення. Будь ласка, введіть не від\'ємне число.',
	'AD_CLICKS_LIMIT_INVALID'	=> 'Недопустиме значення. Будь ласка, введіть не від\'ємне число.',
	'AD_OWNER_INVALID'			=> 'Власник оголошення недійсний. Виберіть користувача за допомогою посилання "Знайти учасника".',
	'NO_FILE_SELECTED'			=> 'Файл не обрано.',
	'CANNOT_CREATE_DIRECTORY'	=> 'Неможливо створити папку <samp>phpbb_ads</samp>. Перевірте папку <samp>/images</samp> доступність для запису (права chmod).',
	'FILE_MOVE_UNSUCCESSFUL'	=> 'Не вдалося перемістити файл до <samp>images/phpbb_ads</samp>.',
	'END_DATE_TOO_SOON'			=> 'Дата завершення має бути пізнішою за дату початку.',
	'ACP_AD_DOES_NOT_EXIST'		=> 'Такого рекламного блоку немає.',
	'ACP_AD_ADD_SUCCESS'		=> 'Блок успішно доданий.',
	'ACP_AD_EDIT_SUCCESS'		=> 'Блок успішно змінено.',
	'ACP_AD_DELETE_SUCCESS'		=> 'Блок успішно видалено.',
	'ACP_AD_DELETE_ERRORED'		=> 'При видаленні блоку виникла помилка.',
	'ACP_AD_ENABLE_SUCCESS'		=> 'Блок успішно увімкнено.',
	'ACP_AD_ENABLE_ERRORED'		=> 'Виникла помилка при включенні блоку.',
	'ACP_AD_DISABLE_SUCCESS'	=> 'Блок успішно вимкнено.',
	'ACP_AD_DISABLE_ERRORED'	=> 'Виникла помилка при вимкненні блоку.',

	// Analyser tests
	'UNSECURE_CONNECTION'	=> '<strong>Змішаний контент</strong><br>Ваша дошка працює через захищене HTTPS-з\’єднання; проте рекламний код намагається завантажити контент із незахищеного HTTP-з\’єднання. Це може призвести до того, що браузери генеруватимуть попередження «Змішаний контент», щоб повідомити користувачів про те, що сторінка містить незахищені ресурси.',
	'SCRIPT_WITHOUT_ASYNC'	=> '<strong>Неасинхронний javascript</strong><br>Цей рекламний код завантажує код JavaScript неасинхронним способом. Це означає, що він блокуватиме завантаження будь-якого іншого JavaScript, доки не завершить завантаження, що може вплинути на продуктивність завантаження сторінки. Використання атрибута <samp>async</samp> може пришвидшити завантаження сторінки.',
	'MARKETING_CONSENT_RECOMMENDED'	=> '<strong>Вимагати згоди на маркетингові дії</strong><br>Ця реклама містить виконувані теги <samp>&lt;script&gt;</samp>. Якщо ця реклама завантажує маркетингові, відстежувальні, файли cookie або інші ресурси, що контролюються згодою, переконайтеся, що для цієї реклами ввімкнено параметр <strong>Вимагати згоди на маркетингові дії</strong> нижче, щоб її скрипти відкладалися, доки відвідувач не дозволить маркетингові дії в налаштуваннях конфіденційності.',
	'MARKETING_CONSENT_VENDOR_RECOMMENDED'	=> '<strong>Виявлено відомого постачальника реклами</strong><br>Ця реклама містить виконувані теги <samp>&lt;script&gt;</samp> від відомого постачальника реклами або маркетингу. Переконайтеся, що для цієї реклами ввімкнено параметр <strong>Вимагати згоди на маркетинг</strong>, щоб її скрипти відкладалися, доки відвідувач не дозволить маркетинг у налаштуваннях конфіденційності.',
	'MARKETING_REVIEW_RECOMMENDED'	=> '<strong>Перевірте вимоги щодо згоди</strong><br>Ця реклама містить виконувані теги <samp>&lt;script&gt;</samp>. Якщо ця реклама завантажує маркетингові, відстежувальні, файли cookie або інші ресурси, що контролюються за згодою, перевірте код реклами та налаштування конфіденційності, щоб переконатися, що він відповідає вашій політиці конфіденційності користувачів.',
	'MARKETING_VENDOR_REVIEW_RECOMMENDED'	=> '<strong>Виявлено відомого постачальника реклами</strong><br>Ця реклама містить виконувані теги <samp>&lt;script&gt;</samp> від відомого постачальника реклами або маркетингу. Перегляньте код реклами та налаштування конфіденційності, щоб переконатися, що вони відповідають вашій політиці конфіденційності користувачів.',
	'ALERT_USAGE'			=> '<strong>Використання <samp>alert()</samp></strong><br>Ваш код використовує функцію <samp>alert()</samp>, що не є гарною практикою та може відволікати користувачів. Деякі браузери також можуть блокувати завантаження сторінки та відображати додаткові попередження користувачеві.',
	'LOCATION_CHANGE'		=> '<strong>Перенаправлення</strong><br>Ваш код, схоже, може перенаправляти користувача на іншу сторінку або сайт. Перенаправлення іноді можуть спрямовувати користувачів до небажаних, часто шкідливих, місць призначення. Будь ласка, перевірте цілісність місця призначення перенаправлення вашого рекламного коду.',
	'IFRAME_USAGE'			=> '<strong>Використання <samp>&lt;iframe&gt;</samp></strong><br>Ваш код містить теги <samp>&lt;iframe&gt;</samp> у форматі HTML. Оскільки iframe можуть запроваджувати відстеження або збір даних третіми сторонами, перевірте цей фрагмент рекламного коду, щоб переконатися, що він відповідає вашій політиці конфіденційності користувачів.',

	// Template location categories
	'CAT_TOP_OF_PAGE'		=> 'Верх сторінки',
	'CAT_BOTTOM_OF_PAGE'	=> 'НИз сторінки',
	'CAT_IN_POSTS'			=> 'У повідомленні',
	'CAT_OTHER'				=> 'Інше',
	'CAT_INTERACTIVE'		=> 'Інтерактив',
	'CAT_SPECIAL'			=> 'Спеціальне',

	// Settings
	'ADBLOCKER_LEGEND'				=> 'Блокувальники реклами',
	'ADBLOCKER_MESSAGE'				=> 'Повідомлення, що виводиться при виявленні блокувальника реклами',
	'ADBLOCKER_MESSAGE_EXPLAIN'		=> 'Відображати повідомлення відвідувачам, у яких встановлено блокувальник реклами, з порадою відключити його на цьому сайті.',
	'CLICKS_VIEWS_LEGEND'			=> 'Статистика',
	'ENABLE_VIEWS'					=> 'Лічильник переглядів',
	'ENABLE_VIEWS_EXPLAIN'			=> 'Це дозволить підрахувати, скільки разів було показано кожне рекламне оголошення. Зверніть увагу, що це додає додаткове навантаження на сервер, тому, якщо вам не потрібна ця функція, вимкніть її.',
	'ENABLE_CLICKS'					=> 'Лічильник кліків',
	'ENABLE_CLICKS_EXPLAIN'			=> 'Це дозволить підрахувати, скільки разів було натиснуто на кожну рекламу. Зверніть увагу, що це додає додаткове навантаження на сервер, тому, якщо вам не потрібна ця функція, вимкніть її.',
	'HIDE_GROUPS'					=> 'Приховати блок для груп',
	'HIDE_GROUPS_EXPLAIN'			=> 'Учасники вибраних груп не бачитимуть блоки. Використовуйте комбінацію CTRL+CLICK (або CMD+CLICK на Mac) для одночасного вибору кількох груп.',

	'ACP_AD_SETTINGS_SAVED'			=> 'Налаштування успішно збережено.',
));
