<?php

/**
 *
 * cmBB [English]
 *
 * @copyright (c) 2016 Ger Bruinsma
 * @license GNU General Public License, version 2 (GPL-2.0)
 *
 */
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'ACP_CATEGORIES_MANAGE'				=> 'Керування категоріями',
	'ACP_CATEGORIES_MANAGE_EXPLAIN'		=> 'Тут можна додавати, змінювати або видаляти категорії. Спочатку ви повинні створити категорію та опублікувати її, а потім змінити налаштування.'
											. '<br />Зверніть увагу: cmBB використовує назву категорії для URL. Тому після того, як ви вибрали назву категорії, рекомендується НЕ змінювати назву згодом, оскільки URL-адреса НЕ буде змінена відповідним чином.',
	'ACP_CMBB_CATEGORIES'				=> 'Категорії',
	'ACP_CMBB_SETTING_SAVED'			=> 'Налаштування cmBB збережено',
	'ACP_CMBB_TITLE'					=> 'cmBB',
	'ACP_MIN_TITLE_LENGTH'				=> 'Мінімальна довжина заголовка',
	'ACP_MIN_TITLE_LENGTH_EXPLAIN'		=> 'Необхідна мінімальна довжина заголовків статей',
	'ACP_MIN_CONTENT_LENGTH'			=> 'Мінімальна довжина контенту',
	'ACP_MIN_CONTENT_LENGTH_EXPLAIN'	=> 'Потрібна мінімальна довжина змісту статті (тіла). Запобігає тарабарщині статей.',
	'ACP_NO_ARTICLES'					=> 'У вас немає (активних) статей. Створіть нову статтю за посиланням нижче:',
	'ACP_NUMBER_INDEX_ITEMS'			=> 'Кількість елементів індексу',
	'ACP_NUMBER_INDEX_ITEMS_EXPLAIN'	=> 'Максимальна кількість останніх елементів для відображення на індексній сторінці. Елементи відсортовані за датою (останні зверху)',
	'ACP_REACT_FORUM_ID'				=> 'Форум для тем коментарів',
	'ACP_REACT_FORUM_ID_EXPLAIN'		=> 'Виберіть форум, щоб створити тему для коментарів.',
	'ACP_SHOW_MENUBAR'					=> 'Показати рядок меню',
	'ACP_SHOW_MENUBAR_EXPLAIN'			=> 'Панель меню додається до заголовка, містить усі категорії з дочірніми елементами, а також домашню сторінку (якщо є), індекс дошки та контакт з нами (якщо включено).',
	'ACP_SHOW_RIGHTBAR'					=> 'Показати праву бічну панель',
	'ACP_SHOW_RIGHTBAR_EXPLAIN'			=> 'Ви можете показати бічну панель праворуч, яка містить будь-який HTML-код, який ви хочете. Корисно для реклами або іншого контенту, який ви хочете показати.',
	'ACP_RIGHTBAR_HTML'					=> 'Вміст правої бічної панелі.',
	'ACP_RIGHTBAR_HTML_EXPLAIN'			=> 'Якщо у вас увімкнена права бічна панель, буде відображатися введений тут контент. Ви можете використовувати будь-який HTML/JS, просто переконайтеся, що він правильний.',
	'CHILDREN'							=> 'Дочірня',
	'CHILDREN_EXPLAIN'					=> 'Кількість статей у цій категорії',
	'CMBB_CATEGORY_NAME_INVALID'		=> 'Неприпустима назва категорії',
	'CMBB_SETTINGS'						=> 'Налаштування cmBB',
	'CMBB_DELETE_CAT_EXPLAIN'			=> 'Категорія може бути видалена лише тоді, коли в ній немає статей',
	'CREATE_CATEGORY'					=> 'Додати категорію',
	'ERROR_CATEGORY_NOT_EMPTY'			=> 'Категорія не порожня',
	'ERROR_FAILED_DELETE'				=> 'Помилка видалення.',
	'NO_REACTIONS'						=> 'Коментарі вимкнені',
	'PROTECTED'							=> 'Захищена',
	'PROTECTED_EXPLAIN'					=> 'Тільки модератори можуть публікувати',
	'SHOW_MENU_BAR'						=> 'Показати в рядку меню',
	'SHOW_MENU_BAR_EXPLAIN'				=> 'Показувати чи ні цю категорію в рядку меню (тільки якщо вона має дочірні елементи). Корисно вимкнути, якщо вам не подобаються списки категорій або є лише декілька статей.',

		));
