<?php
/**
 *
* Акисмет. Расширение программного пакета phpBB Forum.
 *
 * @copyright (c) 2019 Якуб Сенко <jakubsenko@gmail.com>
 * @license Стандартная общественная лицензия GNU, версия 2 (GPL-2.0)
 *
 */

if (!defined('IN_PHPBB'))
{
	exit();
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'ACP_AKISMET_WELCOME'				=> 'Ласкаво просимо в Akismet',
	'ACP_AKISMET_INTRO'					=> 'Це розширення буде використовувати службу <a href="http://akismet.com"> Automattic‘s Akismet </a> для захисту вашого форуму від спаму, автоматично поміщаючи нові підозрілі повідомлення прямо в чергу на модерацію.',
	'ACP_AKISMET_ADMINS_AND_MODS_OKAY'	=> 'Всі повідомлення адміністраторів та модераторів форуму повністю обходитимуть перевірку.',
	'ACP_AKISMET_SIGN_UP'				=> 'Щоб використовувати це розширення, ви повинні спочатку <a href="http://akismet.com"> зареєструватися для отримання ключа API </a>, а потім введіть ключ нижче.',
	'ACP_AKISMET_UNENCRYPTED_WARNING'	=> 'Зверніть увагу, що нові теми та повідомлення будуть передаватися у незашифрованому вигляді, тобто через стандартне http-з\'єднання, на сервери Akismet для перевірки.',

	'ACP_AKISMET_SETTING_CHANGED'	=> 'Налаштування Akismet оновлено.', // For log
	'ACP_AKISMET_SETTING_SAVED'		=> 'Налаштування успішно збережені!',
	'ACP_AKISMET_API_KEY_INVALID'	=> 'Ключ Akismet API недійсний.',

	'ACP_AKISMET_AKISMET_API_KEY'				=> 'Akismet API Ключ',
	'ACP_AKISMET_API_KEY'						=> 'API Key',
	'ACP_AKISMET_REGISTRATION_SETITNGS'			=> 'Налаштування реєстрації',
	'ACP_AKISMET_CHECK_REGISTRATIONS'			=> 'Перевіряйте реєстрації нових користувачів за допомогою Akismet',
	'ACP_AKISMET_CHECK_REGISTRATIONS_EXPLAIN'	=> 'Якщо ви виберете «так», Akismet спробує виявити ймовірних спамерів, як тільки вони зареєструються до того, як вони розмістять будь-які відповіді або нові теми.',

	'ACP_AKISMET_DONT_ADD_REGISTERING_SPAMMERS_TO_GROUP'	=> 'Не додавати реєструючих спамерів до додаткових груп',
	'ACP_AKISMET_ADD_DETECTED_SPAMMERS_TO_GROUP'			=> 'Додати реєструючих спамерів до групи',
	'ACP_AKISMET_ADD_DETECTED_SPAMMERS_TO_GROUP_EXPLAIN'	=> 'Якщо Akismet виявляє реєстрацію «спаму» від нового користувача, додайте його до вибраної групи. Ви можете використовувати це, щоб обмежити їхні права на публікацію повідомлень і т. д., поки не перегляните їх. <strong>Примітка: з міркувань безпеки ви можете додавати нові реєстрації спаму тільки до певних користувачів групи або групи нещодавно зареєстрованих</strong>.',

	'ACP_AKISMET_DONT_ADD_REGISTERING_BLATANT_SPAMMERS_TO_GROUP'	=> 'Не додавати реєструючих спамерів до додаткових груп',
	'ACP_AKISMET_ADD_DETECTED_BLATANT_SPAMMERS_TO_GROUP'			=> 'Додати до групи реєстрацію явних спамерів',
	'ACP_AKISMET_ADD_DETECTED_BLATANT_SPAMMERS_TO_GROUP_EXPLAIN'	=> '«Воплююче» виявлення спамерів Akismet буде запускатися найгіршим, найпоширенішим і очевидним спамом. Ви також можете додати цих спамерів до певної групи, можливо взагалі без прав на відправку повідомлень. <strong>Примітка: з міркувань безпеки ви можете додавати нові реєстрації спаму тільки до певних користувачів групи або групи нещодавно зареєстрованих</strong>.',

	'ACP_AKISMET_POST_SETITNGS'						=> 'Налаштування публікації',
	'ACP_AKISMET_SKIP_CHECK_AFTER_N_POSTS'			=> 'Пропустіть перевірку, якщо у користувача вже є більше, ніж кількість схвалених повідомлень',
	'ACP_AKISMET_SKIP_CHECK_AFTER_N_POSTS_EXPLAIN'	=> 'Встановіть 0, щоб перевіряти всі повідомлення. Це може бути корисно, тому що в разі зламування облікового запису спам-повідомлення будуть відправлятися в чергу на модерацію і можуть бути легко видалені. Але це також підвищує навантаження на сервер.',

	'ACP_AKISMET_ADMIN_FORM_SETITNGS'		=> 'Налаштування форми «Зворотній зв\'язок»',
	'ACP_AKISMET_CHECK_ADMIN_FORM'			=> 'Перевіряти форму зворотнього зв\'язку на спам-повідомлення',
	'ACP_AKISMET_CHECK_ADMIN_FORM_EXPLAIN'	=> 'Якщо ви оберете «так», Akismet припинить розсилку спаму через форму зворотнього зв\'язку. ПОПЕРЕДЖЕННЯ: Це може потенційно перешкодити звичайним користувачам зв\'язатися з вами!',
));
